{
  "backend/main.mo": "Motoko backend defining user profiles, sales, expenses, and goals with access control and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for documentation or build planning.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Root HTML file bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React app handling authentication, navigation, and offline sync setup.",
  "frontend/src/components/IconTile.tsx": "Clickable icon tile used for selecting activity types or categories.",
  "frontend/src/components/PrimaryActionButton.tsx": "Configurable large action button with variants and sizes.",
  "frontend/src/components/ProfitStatusChip.tsx": "Displays today’s profit with colored styling and trend icons.",
  "frontend/src/components/ProgressBar.tsx": "Thin progress bar component with clamped percentage value.",
  "frontend/src/components/SyncStatusChip.tsx": "Shows online/offline status and number of pending offline actions.",
  "frontend/src/components/TopBar.tsx": "Header bar with optional back and logout buttons plus title.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the actor, exposing loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for sales, expenses, stats, and mutations with offline fallback and optimistic data handling.",
  "frontend/src/index.css": "Tailwind configuration and CSS variables for light/dark themes and base styling.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/offline/offlineQueue.ts": "Implements IndexedDB-backed offline action queueing and optimistic data storage.",
  "frontend/src/offline/useConnectivityStatus.ts": "Tracks online/offline browser status with event listeners.",
  "frontend/src/offline/useOfflineSync.ts": "Syncs queued offline actions when reconnected and refreshes related queries.",
  "frontend/src/screens/AddExpenseScreen.tsx": "Form screen for creating an expense with amount and category selection, calling useCreateExpense and navigating back on success.",
  "frontend/src/screens/AddSaleScreen.tsx": "Form screen to record a sale with amount and optional product, using useCreateSale and returning to the dashboard on success.",
  "frontend/src/screens/DailySummaryScreen.tsx": "Displays today’s sales, expenses, and profit using fetched data and lists individual entries for the current day.",
  "frontend/src/screens/DashboardScreen.tsx": "Main dashboard showing user greeting, available cash, today's profit, and navigation buttons for sales, expenses, and summaries.",
  "frontend/src/screens/MonthlyGoalScreen.tsx": "Allows setting a monthly savings goal, shows progress toward it, and updates the goal via useSetMonthlyGoal.",
  "frontend/src/screens/ProfileSetupScreen.tsx": "Initial profile creation screen collecting first name and activity type, saving via useSaveProfile before entering the app.",
  "frontend/src/screens/WelcomeScreen.tsx": "React welcome screen with hero image, text, and a start button that triggers Internet Identity login.",
  "frontend/src/utils/calculations.ts": "Utility functions computing available cash, daily profit, and goal progress from sales and expenses.",
  "frontend/src/utils/dates.ts": "Date helpers to detect today, get current month/year, and check if a timestamp falls in a given month.",
  "frontend/src/utils/money.ts": "Functions to format numbers as GNF currency and parse GNF-formatted input into numeric values.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing/retrieving them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "JSON describing the project’s current state, goals, architecture, features, and required assets for the finance app."
}