{
  "backend/main.mo": "Motoko canister managing users, profiles, sales, expenses, and goals with access control, storage maps, and CRUD-style operations.",
  "feature_evidence.json": "Feature evidence report listing implemented account-switching and logout-related frontend changes with associated files and metadata.",
  "frontend-file-summaries.txt": "Text file containing predefined short summaries of all major frontend components, screens, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and applying global background/foreground styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app controlling authentication-driven navigation and screen rendering with offline sync and loading states.",
  "frontend/src/components/IconTile.tsx": "Clickable icon tile component used for selecting categories or activity types with selected-state visuals.",
  "frontend/src/components/PrimaryActionButton.tsx": "Reusable styled button component supporting variants, sizes, and optional icons for primary actions.",
  "frontend/src/components/ProfitStatusChip.tsx": "Chip showing today's profit with color-coded styling and trend icons.",
  "frontend/src/components/ProgressBar.tsx": "Simple wrapper around a progress component that clamps and displays goal progress.",
  "frontend/src/components/SwitchAccountConfirmDialog.tsx": "Confirmation dialog warning users about logout and potential loss of pending offline actions before switching accounts.",
  "frontend/src/components/SyncStatusChip.tsx": "Floating chip showing online/offline status and number of pending offline actions.",
  "frontend/src/components/TopBar.tsx": "A header component showing a title with optional back and switch-account buttons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the active actor and tracks loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for sales, expenses, cash, stats, goals, and mutations with offline support.",
  "frontend/src/hooks/useSwitchAccount.ts": "Clears offline data, query cache, and identity session to switch accounts.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/offline/offlineQueue.ts": "Implements IndexedDB-backed offline action queueing and optimistic data storage.",
  "frontend/src/offline/useConnectivityStatus.ts": "Tracks online/offline browser connectivity state.",
  "frontend/src/offline/useOfflineSync.ts": "Syncs queued offline actions when back online and refreshes cached data.",
  "frontend/src/screens/AddExpenseScreen.tsx": "UI for recording an expense with amount and category, handling validation, creation, and account switching.",
  "frontend/src/screens/AddSaleScreen.tsx": "Screen to add a sale including amount and optional product, with form validation and account switching support.",
  "frontend/src/screens/DailySummaryScreen.tsx": "Displays today's sales, expenses, and profit with motivational messaging and account switching.",
  "frontend/src/screens/DashboardScreen.tsx": "Main dashboard showing greeting, available cash, today’s profit, and navigation to key actions and summaries.",
  "frontend/src/screens/MonthlyGoalScreen.tsx": "Allows setting and viewing monthly financial goals with progress tracking and remaining amount calculation.",
  "frontend/src/screens/ProfileSetupScreen.tsx": "Initial profile setup where users enter their name and select an activity type before starting the app.",
  "frontend/src/screens/WelcomeScreen.tsx": "React welcome screen that shows a hero image, app title, and a start button that triggers Internet Identity login.",
  "frontend/src/utils/calculations.ts": "Utility functions computing available cash, daily profit, and monthly goal progress from sales and expenses.",
  "frontend/src/utils/dates.ts": "Date helpers for checking if timestamps are today or in a given month and retrieving current month/year.",
  "frontend/src/utils/money.ts": "Formats numbers into GNF currency strings and parses GNF input back into numeric values.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in session storage, and managing hash-based routing params.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, radius, shadows, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Metadata describing the project’s state, architecture, features, and requirements for a finance-tracking mobile app."
}