{
  "kind": "build_request",
  "title": "Enhance logout to support switching Internet Identity accounts",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add a clear, user-visible “Switch account” / logout action that signs the user out of Internet Identity and returns the app to the Welcome screen so the user can log in with a different account.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "AUGMENTE L'OPTION DE DECONEXION POUR CHANGER DE COMPTE"
        ]
      },
      "acceptanceCriteria": [
        "From the Dashboard, the user can explicitly trigger a sign-out action intended for switching accounts.",
        "After signing out, the app shows the Welcome screen and the user can log in again with a different Internet Identity.",
        "No authenticated screens (Dashboard/Add Sale/Add Expense/Daily Summary/Monthly Goal/Profile Setup) remain accessible after logout unless the user logs in again."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add a confirmation dialog before logout that warns the user they are about to sign out and can switch accounts; if there are pending offline actions, explicitly warn that they will be cleared to avoid mixing data between accounts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "AUGMENTE L'OPTION DE DECONEXION POUR CHANGER DE COMPTE"
        ]
      },
      "acceptanceCriteria": [
        "Tapping the logout/switch-account action opens a confirmation dialog with English copy.",
        "If there are pending offline actions, the dialog indicates pending actions exist and that proceeding will clear them.",
        "Cancel keeps the user signed in and returns to the current screen; Confirm completes logout."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Ensure switching accounts does not leak or mix offline-first queued actions or optimistic data across users by clearing the IndexedDB offline queue and optimistic store as part of the logout flow, along with clearing React Query cached data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "AUGMENTE L'OPTION DE DECONEXION POUR CHANGER DE COMPTE"
        ]
      },
      "acceptanceCriteria": [
        "After logout, the offline action queue is empty (no pending actions remain).",
        "After logout, any optimistic/offline locally stored sales/expenses are cleared and do not appear for the next logged-in account.",
        "After logout, React Query cache is cleared so the next account does not briefly display the previous account’s cached values."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Expose the logout/switch-account action consistently wherever a TopBar is shown (not only on the Dashboard), so the user can switch accounts from any main screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "AUGMENTE L'OPTION DE DECONEXION POUR CHANGER DE COMPTE"
        ]
      },
      "acceptanceCriteria": [
        "Add Sale, Add Expense, Daily Summary, and Monthly Goal screens provide access to the same logout/switch-account action (e.g., via TopBar action).",
        "Logout behavior is consistent across all screens (confirmation + sign out + reset to Welcome)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts or any other frontend immutablePaths; consume the existing `clear()` method from the Internet Identity hook instead.",
    "Backend remains single-actor; no backend changes are required for logout/switch-account behavior."
  ],
  "nonGoals": [
    "Adding multiple profiles under one Internet Identity principal.",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Implementing account management UI beyond sign out / switch account."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}