{
  "kind": "build_request",
  "title": "Build “Gère Mon Argent” mobile-first cashbook app (Guinea, GNF) with offline-first entry + sync",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend data model and APIs for a single-user-per-Principal cashbook: user profile, sales, expenses, and monthly goals, matching the provided collections/fields (Users: firstName, activityType, language; Sales: date, amount, product?; Expenses: date, amount, category; Goals: month, monthlyGoalAmount). Provide CRUD methods needed by the UI and computed-query methods needed for dashboard/summary/goal progress.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "🧱 STRUCTURE DES DONNÉES (FIREBASE / BACKEND)\nCollection : Users ... Collection : Ventes ... Collection : Depenses ... Collection : Objectifs ...",
          "⚙️ LOGIQUE AUTOMATIQUE À IMPLÉMENTER\nFormules :\n• Argent disponible = Σ ventes – Σ dépenses\n• Bénéfice journalier = ventes du jour – dépenses du jour\n• Progression objectif = (argent cumulé / objectif mensuel) × 100"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores user profile keyed by caller Principal and can be created/updated/read.",
        "Backend supports creating/listing sales and expenses for the caller, including filtering by day and by month.",
        "Backend supports setting/getting a monthly goal for a given month for the caller.",
        "Backend exposes a query to return: availableCash (all-time or current month—align with UI definition), todaySalesTotal, todayExpensesTotal, todayProfit, monthSalesTotal, monthExpensesTotal, goalProgressPercent, goalRemainingAmount.",
        "All amounts are stored as integers in GNF (no floating point); API docs/comments clarify this."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Create a mobile-first frontend with the 7 requested screens and navigation flow: Welcome (language selection + start), Profile Setup (first name + activity type via large icons), Dashboard (greeting + today available cash in GNF + two primary actions), Add Sale (amount + optional product), Add Expense (amount + category via large icons), Daily Summary (today’s sales list, expenses list, auto daily profit, motivational message), Monthly Goal (set goal, progress bar, remaining amount, link to view goals/history if implemented).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "🖥️ ÉCRANS À GÉNÉRER\n🟦 Écran 1 : Bienvenue ... 🟦 Écran 7 : Objectif mensuel ..."
        ]
      },
      "acceptanceCriteria": [
        "All screens are reachable via clear navigation appropriate for low-literacy users (large tap targets, minimal text).",
        "UI copy used in the app is in English (e.g., “Welcome! Manage your money easily”, “I sold”, “I spent”, “Validate”, etc.).",
        "Dashboard shows “Hello, {firstName}” and displays “Today: {availableCash} GNF”.",
        "Add Sale and Add Expense forms validate that amount is required and positive; successful submit returns to Dashboard or shows a success state.",
        "Daily Summary shows today’s items and “Daily profit = today sales − today expenses”, plus a motivational message: “Well done! You earned {amount} GNF”.",
        "Monthly Goal screen allows entering a monthly goal amount and shows progress percentage and remaining amount."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement offline-first data entry on the frontend: allow creating sales/expenses/goals while offline by queuing writes locally, and automatically sync queued actions to the backend when connectivity is restored, without data loss or duplicate entries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "• Fonctionnement hors ligne + synchronisation",
          "🧠 OPTIONS BONUS À PRÉVOIR\n• Mode hors ligne\n• Synchronisation automatique"
        ]
      },
      "acceptanceCriteria": [
        "When the app is offline, users can still add a sale/expense/goal and see it reflected immediately in UI totals/lists (optimistic local state).",
        "Queued offline actions persist across page refresh (e.g., using IndexedDB/local storage) until successfully synced.",
        "When the app returns online, queued actions are synced automatically and removed from the queue only after backend confirmation.",
        "The UI indicates offline/online status and shows a small “Sync pending” indicator when queued actions exist."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Wire the frontend to the backend using the project’s standard actor/auth approach (Internet Identity), ensuring each user’s data is isolated and that profile creation is required before showing the main dashboard actions.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Collection : Users\n• id\n• prenom\n• type_activite\n• langue"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users are prompted to sign in (Internet Identity) before accessing personal data.",
        "After first sign-in, user is directed to Profile Setup if no profile exists.",
        "After profile exists, user lands on Dashboard and sees their stored first name and activity type.",
        "All create/list calls operate only on the authenticated user’s records (no cross-user access)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement the automatic calculations in the UI and/or backend (consistent and testable): available cash = sum(sales) − sum(expenses); daily profit = today sales − today expenses; monthly goal progress = (month net or month sales—use the definition shown in UI) / goal × 100, with safe handling when goal is 0 or missing.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "⚙️ LOGIQUE AUTOMATIQUE À IMPLÉMENTER\nFormules :\n• Argent disponible = Σ ventes – Σ dépenses\n• Bénéfice journalier = ventes du jour – dépenses du jour\n• Progression objectif = (argent cumulé / objectif mensuel) × 100"
        ]
      },
      "acceptanceCriteria": [
        "Available cash and daily profit values match backend totals for the same period.",
        "Monthly progress shows 0% when no goal is set; never divides by zero.",
        "All monetary values are displayed with GNF suffix and use thousands separators for readability (e.g., 100,000 GNF)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Apply an accessible, low-literacy visual design system tailored to Guinea market traders: primary blue, success green, action orange; large buttons; large icons; simple typography; warm “modern African” feel; consistent spacing and contrast across all screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "🎨 DESIGN SYSTEM\n• Couleurs :\n o Bleu (primary)\n o Vert (success)\n o Orange (action)\n• Boutons larges\n• Icônes grandes\n• Police simple\n• UX pour personnes peu alphabétisées\n• Style éducatif, chaleureux, africain moderne"
        ]
      },
      "acceptanceCriteria": [
        "Primary actions (“I sold”, “I spent”, “Start”, “Validate”) are visually prominent and meet large tap-target sizing suitable for mobile.",
        "Iconography is used for activity types and expense categories; text labels remain short and clear.",
        "Color usage is consistent: blue for navigation/primary UI, green for positive states, orange for action/attention states.",
        "Layouts are optimized for small screens first (no horizontal scrolling, readable font sizes)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add simple performance visualization elements for monthly progression and daily performance (e.g., progress bar for goal and a compact visual summary on dashboard/summary) while keeping the UI extremely simple.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "• Visualiser les performances",
          "🟦 Écran 7 : Objectif mensuel\n• Barre de progression"
        ]
      },
      "acceptanceCriteria": [
        "Monthly Goal screen includes a progress bar reflecting computed progress percent.",
        "Dashboard or Daily Summary includes a clear, minimal visual cue (e.g., a small bar or chip) for today’s profit status (positive/negative/zero) without adding complex charts."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add generated static assets (illustrations + icons) to support a highly visual onboarding and category selection experience, and render them in the relevant screens from frontend/public/assets/generated (do not serve images from the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "🟦 Écran 1 : Bienvenue\n• Illustration : marché africain / boutique",
          "Choix type d’activité (icônes) ...",
          "Catégories avec icônes ..."
        ]
      },
      "acceptanceCriteria": [
        "Welcome screen displays the generated market/boutique illustration.",
        "Profile activity type choices and expense categories use the generated icon set consistently.",
        "All generated images are stored under frontend/public/assets/generated and referenced directly by the frontend."
      ]
    }
  ],
  "constraints": [
    "Use the existing React + TypeScript + Tailwind + React Query frontend stack; do not introduce FlutterFlow.",
    "Use a single Motoko actor for all backend logic (backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or other immutablePaths; compose them instead.",
    "No Firebase integration; persist data on the Internet Computer backend and implement offline queueing locally in the browser.",
    "No third-party auth providers; use Internet Identity only."
  ],
  "nonGoals": [
    "Android APK export (deliver as a mobile-friendly web app running in the browser).",
    "Push notifications and background scheduled notifications.",
    "Voice/audio guidance (explicitly marked as later by the user).",
    "Real-time features (websockets/live updates)."
  ],
  "imageRequirements": {
    "required": [
      "Warm modern African market/boutique illustration, friendly and educational, vector style (welcome-hero.dim_1400x900.png)",
      "Large simple icon for activity type: Shop/storefront, flat style (icon-activity-shop.dim_256x256.png)",
      "Large simple icon for activity type: Food, flat style (icon-activity-food.dim_256x256.png)",
      "Large simple icon for activity type: Clothing, flat style (icon-activity-clothing.dim_256x256.png)",
      "Large simple icon for activity type: Transport, flat style (icon-activity-transport.dim_256x256.png)",
      "Large simple icon for expense category: Merchandise/stock, flat style (icon-expense-merchandise.dim_256x256.png)",
      "Large simple icon for expense category: Transport, flat style (icon-expense-transport.dim_256x256.png)",
      "Large simple icon for expense category: Food, flat style (icon-expense-food.dim_256x256.png)",
      "Large simple icon for expense category: Other/misc, flat style (icon-expense-other.dim_256x256.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Mobile-first, highly visual UX for low-literacy users in Guinea; currency GNF; French/local language selection concept."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}