{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Switch-account logout flow for Internet Identity with offline/cache reset",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Provide a clear “Switch account” action that logs out of Internet Identity and returns the user to the Welcome screen for re-login.",
      "acceptanceCriteria": [
        "From the Dashboard, the user can explicitly trigger a sign-out action intended for switching accounts.",
        "After signing out, the app shows the Welcome screen and the user can log in again with a different Internet Identity.",
        "No authenticated screens (Dashboard/Add Sale/Add Expense/Daily Summary/Monthly Goal/Profile Setup) remain accessible after logout unless the user logs in again."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSwitchAccount.ts",
          "operation": "create",
          "description": "Create a shared logout/switch-account helper hook that calls the existing Internet Identity hook `clear()` (do not modify useInternetIdentity.ts), clears React Query cached data, clears offline/optimistic local stores, and triggers navigation back to the Welcome screen."
        },
        {
          "path": "frontend/src/screens/DashboardScreen.tsx",
          "operation": "modify",
          "description": "Replace the existing direct logout logic with the shared switch-account flow (use `clear()` from the Internet Identity hook, clear React Query, clear offline/optimistic stores, and navigate to Welcome). Ensure the action is clearly labeled as “Switch account”."
        },
        {
          "path": "frontend/src/components/TopBar.tsx",
          "operation": "modify",
          "description": "Update the TopBar action area to present a clearly user-visible “Switch account” action (not just an ambiguous icon), while still supporting existing back navigation."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure screen selection continues to reset to the Welcome screen when identity becomes unauthenticated, so authenticated screens cannot remain visible after logout."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add a confirmation dialog for switching accounts, including an explicit warning about clearing pending offline actions when present.",
      "acceptanceCriteria": [
        "Tapping the logout/switch-account action opens a confirmation dialog with English copy.",
        "If there are pending offline actions, the dialog indicates pending actions exist and that proceeding will clear them.",
        "Cancel keeps the user signed in and returns to the current screen; Confirm completes logout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SwitchAccountConfirmDialog.tsx",
          "operation": "create",
          "description": "Create a reusable confirmation dialog component with English copy for switching accounts. Use the shadcn-ui AlertDialog (or equivalent dialog primitive from the existing shadcn/ui setup) to implement the modal. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/TopBar.tsx",
          "operation": "modify",
          "description": "Wire the “Switch account” action to open the confirmation dialog, show the pending-offline-actions warning when applicable, and call the provided confirm handler only when the user confirms. Use shadcn-ui Button styling for consistent UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/offline/offlineQueue.ts",
          "operation": "modify",
          "description": "Expose a lightweight way for the UI to determine whether pending offline actions exist (e.g., by reusing getQueuedActions / queue length) so the confirmation dialog can conditionally show the warning."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Prevent cross-account data leakage by clearing IndexedDB offline queue, optimistic store, and React Query cache as part of the logout/switch-account flow.",
      "acceptanceCriteria": [
        "After logout, the offline action queue is empty (no pending actions remain).",
        "After logout, any optimistic/offline locally stored sales/expenses are cleared and do not appear for the next logged-in account.",
        "After logout, React Query cache is cleared so the next account does not briefly display the previous account’s cached values."
      ],
      "file_operations": [
        {
          "path": "frontend/src/offline/offlineQueue.ts",
          "operation": "modify",
          "description": "Add an exported logout-safe clearing function that clears both the IndexedDB offline action queue store and the optimistic data store (not only optimistic), to be used during switch-account."
        },
        {
          "path": "frontend/src/hooks/useSwitchAccount.ts",
          "operation": "modify",
          "description": "Implement the switch-account confirm action to: (1) clear IndexedDB offline queue and optimistic store, (2) clear React Query cache, then (3) call the existing Internet Identity `clear()` method, and (4) navigate to Welcome to avoid showing authenticated screens."
        },
        {
          "path": "frontend/src/offline/useOfflineSync.ts",
          "operation": "modify",
          "description": "Ensure offline sync behavior remains safe after a logout-triggered clear (e.g., it should naturally no-op with an empty queue and cleared optimistic data) and does not repopulate cleared UI state."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Expose the switch-account action consistently on all TopBar screens and ensure identical logout behavior everywhere.",
      "acceptanceCriteria": [
        "Add Sale, Add Expense, Daily Summary, and Monthly Goal screens provide access to the same logout/switch-account action (e.g., via TopBar action).",
        "Logout behavior is consistent across all screens (confirmation + sign out + reset to Welcome)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/AddSaleScreen.tsx",
          "operation": "modify",
          "description": "Add the TopBar switch-account action to this screen and wire it to the shared switch-account flow (confirmation + clear offline/optimistic + clear React Query + `clear()` + navigate to Welcome)."
        },
        {
          "path": "frontend/src/screens/AddExpenseScreen.tsx",
          "operation": "modify",
          "description": "Add the TopBar switch-account action to this screen and wire it to the shared switch-account flow (confirmation + full clear + navigate to Welcome)."
        },
        {
          "path": "frontend/src/screens/DailySummaryScreen.tsx",
          "operation": "modify",
          "description": "Add the TopBar switch-account action to this screen and wire it to the shared switch-account flow (confirmation + full clear + navigate to Welcome)."
        },
        {
          "path": "frontend/src/screens/MonthlyGoalScreen.tsx",
          "operation": "modify",
          "description": "Add the TopBar switch-account action to this screen and wire it to the shared switch-account flow (confirmation + full clear + navigate to Welcome)."
        }
      ]
    }
  ]
}